
--○ 각자 태어난 날짜 및 시각으로부터...현재까지
--   얼마만큼의 시간을 살고 있는지...
--   다음과 같은 형태로 조회할 수 있도록 쿼리문을 구성한다.
/*
------------------  ------------------------  ------  -------  ---------  ------
현재시각            생년월일                    일      시간     분         초
------------------  ------------------------  ------  -------  ---------  ------
2022-08-17 12:36:20 1994-06-01 12:00:00       130     5        22        40


-- 생년월일로부터 현재까지 총 단위 계산(단위 : 초)
SELECT 기간 * (하루를구성하는전체초)
FROM DUAL;

SELECT ((SYSDATE - TO_DATE('1994-07-04 01:47:00','YYYY-MM-DD HH24:MI:SS')) *(24*60*60))
FROM DUAL;

-- 초를 기준으로 '일', '시간', '분' ,'초' 구하는 방법
SELECT  TRUNC(TRUNC(TRUNC(93784/60)/60)/24)"일"
    ,   MOD(TRUNC(TRUNC(93784/60)/60),24)"시간"
    ,   MOD(TRUNC(93784/60),60) "분"
    ,   MOD(93784, 60) "초"
FROM DUAL;

*/

SELECT SYSDATE "현재시각"
    ,   TO_DATE('1994-07-04 01:47:00','YYYY-MM-DD HH24:MI:SS') "생년월일"
    ,   TRUNC(TRUNC(TRUNC( ((SYSDATE - TO_DATE('1994-07-04 01:47:00','YYYY-MM-DD HH24:MI:SS')) *(24*60*60))/60)/60)/24)"일"
    ,   MOD(TRUNC(TRUNC( ((SYSDATE - TO_DATE('1994-07-04 01:47:00','YYYY-MM-DD HH24:MI:SS')) *(24*60*60))/60)/60),24)"시간"
    ,   MOD(TRUNC( ((SYSDATE - TO_DATE('1994-07-04 01:47:00','YYYY-MM-DD HH24:MI:SS')) *(24*60*60))/60),60) "분"
    ,   TRUNC(MOD( ((SYSDATE - TO_DATE('1994-07-04 01:47:00','YYYY-MM-DD HH24:MI:SS')) *(24*60*60)), 60)) "초"
FROM DUAL;

